Revit 2024 API
ExternalResourceTypes.BuiltInExternalResourceTypes.CADLink Property
 An external resource type representing CAD Links data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalResourceType CADLink { get; }
Visual Basic
Public Shared ReadOnly Property CADLink As ExternalResourceType
	Get
Visual C++
public:
static property ExternalResourceType^ CADLink {
	ExternalResourceType^ get ();
}
See Also
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace